Revit 2026 API

# UIControlledApplicationGetRibbonPanels(String) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual List<RibbonPanel> GetRibbonPanels(
	string tabName
)
```
```vb
Public Overridable Function GetRibbonPanels (
	tabName As String
) As List(Of RibbonPanel)
```
```cpp
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	String^ tabName
)
```
```fsharp
abstract GetRibbonPanels :
        tabName : string -> List<RibbonPanel>
override GetRibbonPanels :
        tabName : string -> List<RibbonPanel>
```

#### Parameters

tabName String

#### Return Value

ListRibbonPanel

#### Reference

UIControlledApplication Class

GetRibbonPanels Overload

Autodesk.Revit.UI Namespace